org/2015-02-02-Integrate-7z-With-Emacs.org
#+TITLE: Integrate 7z and Tar With Emacs
#+AUTHOR: Yang, Ying-chao
#+EMAIL:  yangyingchao[at]gmail[dot]com
#+KEYWORDS: Emacs, 7z, Dired
#+CATEGORY: Emacs
#+DESCRIPTION: (nil)
#+OPTIONS:  ^:nil toc:1 H:3 \n:nil ::t |:t ^:{} -:t f:t *:t tex:t d:(HIDE) tags:not-in-toc
#+STARTUP:    align nodlcheck oddeven lognotestate
#+SEQ_TODO:   TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+TAGS:       Write(w) Update(u) Fix(f) Check(c) noexport(n)
#+LANGUAGE:   en
#+HTML_HEAD: <style type="text/css">#outline-container-introduction{ clear:both; }</style>
#+LINK_UP:    http://yangyingchao.github.io
#+LINK_HOME:  http://yangyingchao.github.io
#+EXCLUDE_TAGS: noexport

In dired-mode of emacs, we can compress/decompress files quickly by pressing one key:
=Z=. This key will trigger function =dired-do-compress= which in turn will call
=dired-compress= to do real works.

I don't like the default implementation of =dired-compress= because:

1. it can't process zip/rar/7z files.
2. For files such as "tar.gz", "tar.bz2" it simply decompresses them into "tar" files

I made a advice to =dired-compress= to make it works as I expected. You can copy it to
your dot emacs if you want.

#+BEGIN_SRC emacs-lisp -r -n
  ;; Use 7z and tar to compress/decompress file if possible.
  (defvar yc/dired-compress-file-suffixes
    (list
     ;; Regexforsuffix-Programm-Args.
     (list (rx "." (or "gz" "Z" "z" "dz" "bz2" "xz" "zip" "rar" "7z")) "7z" "x")
     (list (rx "." (or "tar.gz" "tgz")) "tar" "xzvf")
     (list (rx "." (or "tar.bz2" "tbz")) "tar" "xjvf")
     (list (rx ".tar.xz") "tar" "xJvf"))
    "nil")

  (defun yc/dired-check-process (msg program &rest arguments)
    (let (err-buffer err (dir default-directory))
      (message "%s..." msg )
      (save-excursion
        ;; Get a clean buffer for error output:
        (setq err-buffer (get-buffer-create " *dired-check-process output*"))
        (set-buffer err-buffer)
        (erase-buffer)
        (setq default-directory dir   ; caller's default-directory
              err (not (eq 0 (apply 'process-file program nil t nil
                                    (if (string= "7z" program) "-y" " ") arguments))))
        (if err
            (progn
              (if (listp arguments)
                  (let ((args "") )
                    (mapc (lambda (X)
                              (setq args (concat args X " ")))
                            arguments)
                    (setq arguments args)))
              (dired-log (concat program " " (prin1-to-string arguments) "\n"))
              (dired-log err-buffer)
              (or arguments program t))
          (kill-buffer err-buffer)
          (message "%s...done" msg)
          nil))))


  (defun yc/dired-compress-file (file)
    ;; Compress or uncompress FILE.
    ;; Return the name of the compressed or uncompressed file.
    ;; Return nil if no change in files.
    (let ((handler (find-file-name-handler file 'dired-compress-file))
          suffix newname
          (suffixes yc/dired-compress-file-suffixes))

      ;; See if any suffix rule matches this file name.
      (while suffixes
        (let (case-fold-search)
          (if (string-match (car (car suffixes)) file)
              (setq suffix (car suffixes) suffixes nil))
          (setq suffixes (cdr suffixes))))
      ;; If so, compute desired new name.
      (if suffix
          (setq newname (substring file 0 (match-beginning 0))))
      (cond (handler
             (funcall handler 'dired-compress-file file))
            ((file-symlink-p file)
             nil)
            ((and suffix (nth 1 suffix))
             ;; We found an uncompression rule.
             (if
                 (and (or (not (file-exists-p newname))
                          (y-or-n-p
                           (format "File %s already exists.  Replace it? "
                                   newname)))
                      (not (yc/dired-check-process (concat "Uncompressing " file)
                                                   (nth 1 suffix) (nth 2 suffix) file)))
                 newname))
            (t
             ;;; We don't recognize the file as compressed, so compress it.
             ;;; Try gzip; if we don't have that, use compress.
             (condition-case nil
                 (let ((out-name (concat file ".7z")))
                   (and (or (not (file-exists-p out-name))
                            (y-or-n-p
                             (format "File %s already exists.  Really compress? "
                                     out-name)))
                        (not (yc/dired-check-process (concat "Compressing " file)
                                                     "7z" "a" out-name file))
                        ;; Rename the compressed file to NEWNAME
                        ;; if it hasn't got that name already.
                        (if (and newname (not (equal newname out-name)))
                            (progn
                              (rename-file out-name newname t)
                              newname)
                          out-name))))))))

  (defadvice dired-compress (around yc/dired-compress )
    "If last action was not a yank, run `browse-kill-ring' instead."
    (let* (buffer-read-only
           (from-file (dired-get-filename))
           (new-file (yc/dired-compress-file from-file)))
      (if new-file
          (let ((start (point)))
            ;; Remove any preexisting entry for the name NEW-FILE.
            (ignore-errors (dired-remove-entry new-file))
            (goto-char start)
            ;; Now replace the current line with an entry for NEW-FILE.
            (dired-update-file-line new-file) nil)
        (dired-log (concat "Failed to compress" from-file))
        from-file))
    )
  (ad-activate 'dired-compress)

#+END_SRC

 You can find it at
 [[https://github.com/yangyingchao/tubo-env/blob/master/.emacs.d/rc/05-rc-misc.el]] line:129.