_posts/2015-02-02-Integrate-7z-With-Emacs.html
---
layout : post
title : Integrate 7z and Tar With Emacs
categories : Emacs
tags :  emacs  7z  dired
---
<p>
In dired-mode of emacs, we can compress/decompress files quickly by pressing one key:
<code>Z</code>. This key will trigger function <code>dired-do-compress</code> which in turn will call
<code>dired-compress</code> to do real works.
</p>

<p>
I don't like the default implementation of <code>dired-compress</code> because:
</p>

<ol class="org-ol">
<li>it can't process zip/rar/7z files.
</li>
<li>For files such as "tar.gz", "tar.bz2" it simply decompresses them into "tar" files
</li>
</ol>

<p>
I made a advice to <code>dired-compress</code> to make it works as I expected. You can copy it to
your dot emacs if you want.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr">  1: </span><span style="color: #fa8072;">;; </span><span style="color: #cd5c5c; font-style: italic;">Use 7z and tar to compress/decompress file if possible.</span>
<span class="linenr">  2: </span>(<span style="color: #ff4040;">defvar</span> <span style="color: #daa520;">yc/dired-compress-file-suffixes</span>
<span class="linenr">  3: </span>  (list
<span class="linenr">  4: </span>   <span style="color: #fa8072;">;; </span><span style="color: #cd5c5c; font-style: italic;">Regexforsuffix-Programm-Args.</span>
<span class="linenr">  5: </span>   (list (rx <span style="color: #d78700;">"."</span> (or <span style="color: #d78700;">"gz"</span> <span style="color: #d78700;">"Z"</span> <span style="color: #d78700;">"z"</span> <span style="color: #d78700;">"dz"</span> <span style="color: #d78700;">"bz2"</span> <span style="color: #d78700;">"xz"</span> <span style="color: #d78700;">"zip"</span> <span style="color: #d78700;">"rar"</span> <span style="color: #d78700;">"7z"</span>)) <span style="color: #d78700;">"7z"</span> <span style="color: #d78700;">"x"</span>)
<span class="linenr">  6: </span>   (list (rx <span style="color: #d78700;">"."</span> (or <span style="color: #d78700;">"tar.gz"</span> <span style="color: #d78700;">"tgz"</span>)) <span style="color: #d78700;">"tar"</span> <span style="color: #d78700;">"xzvf"</span>)
<span class="linenr">  7: </span>   (list (rx <span style="color: #d78700;">"."</span> (or <span style="color: #d78700;">"tar.bz2"</span> <span style="color: #d78700;">"tbz"</span>)) <span style="color: #d78700;">"tar"</span> <span style="color: #d78700;">"xjvf"</span>)
<span class="linenr">  8: </span>   (list (rx <span style="color: #d78700;">".tar.xz"</span>) <span style="color: #d78700;">"tar"</span> <span style="color: #d78700;">"xJvf"</span>))
<span class="linenr">  9: </span>  <span style="color: #87ceeb;">"nil"</span>)
<span class="linenr"> 10: </span>
<span class="linenr"> 11: </span>(<span style="color: #ff4040;">defun</span> <span style="color: #1e90ff; font-weight: bold;">yc/dired-check-process</span> (msg program <span style="color: #32cd32;">&amp;rest</span> arguments)
<span class="linenr"> 12: </span>  (<span style="color: #ff4040;">let</span> (err-buffer err (dir default-directory))
<span class="linenr"> 13: </span>    (message <span style="color: #d78700;">"%s..."</span> msg )
<span class="linenr"> 14: </span>    (<span style="color: #ff4040;">save-excursion</span>
<span class="linenr"> 15: </span>      <span style="color: #fa8072;">;; </span><span style="color: #cd5c5c; font-style: italic;">Get a clean buffer for error output:</span>
<span class="linenr"> 16: </span>      (setq err-buffer (get-buffer-create <span style="color: #d78700;">" *dired-check-process output*"</span>))
<span class="linenr"> 17: </span>      (set-buffer err-buffer)
<span class="linenr"> 18: </span>      (erase-buffer)
<span class="linenr"> 19: </span>      (setq default-directory dir   <span style="color: #fa8072;">; </span><span style="color: #cd5c5c; font-style: italic;">caller's default-directory</span>
<span class="linenr"> 20: </span>            err (not (eq 0 (apply 'process-file program nil t nil
<span class="linenr"> 21: </span>                                  (<span style="color: #ff4040;">if</span> (string= <span style="color: #d78700;">"7z"</span> program) <span style="color: #d78700;">"-y"</span> <span style="color: #d78700;">" "</span>) arguments))))
<span class="linenr"> 22: </span>      (<span style="color: #ff4040;">if</span> err
<span class="linenr"> 23: </span>          (<span style="color: #ff4040;">progn</span>
<span class="linenr"> 24: </span>            (<span style="color: #ff4040;">if</span> (listp arguments)
<span class="linenr"> 25: </span>                (<span style="color: #ff4040;">let</span> ((args <span style="color: #d78700;">""</span>) )
<span class="linenr"> 26: </span>                  (mapc (<span style="color: #ff4040;">lambda</span> (X)
<span class="linenr"> 27: </span>                            (setq args (concat args X <span style="color: #d78700;">" "</span>)))
<span class="linenr"> 28: </span>                          arguments)
<span class="linenr"> 29: </span>                  (setq arguments args)))
<span class="linenr"> 30: </span>            (dired-log (concat program <span style="color: #d78700;">" "</span> (prin1-to-string arguments) <span style="color: #d78700;">"\n"</span>))
<span class="linenr"> 31: </span>            (dired-log err-buffer)
<span class="linenr"> 32: </span>            (or arguments program t))
<span class="linenr"> 33: </span>        (kill-buffer err-buffer)
<span class="linenr"> 34: </span>        (message <span style="color: #d78700;">"%s...done"</span> msg)
<span class="linenr"> 35: </span>        nil))))
<span class="linenr"> 36: </span>
<span class="linenr"> 37: </span>
<span class="linenr"> 38: </span>(<span style="color: #ff4040;">defun</span> <span style="color: #1e90ff; font-weight: bold;">yc/dired-compress-file</span> (file)
<span class="linenr"> 39: </span>  <span style="color: #fa8072;">;; </span><span style="color: #cd5c5c; font-style: italic;">Compress or uncompress FILE.</span>
<span class="linenr"> 40: </span>  <span style="color: #fa8072;">;; </span><span style="color: #cd5c5c; font-style: italic;">Return the name of the compressed or uncompressed file.</span>
<span class="linenr"> 41: </span>  <span style="color: #fa8072;">;; </span><span style="color: #cd5c5c; font-style: italic;">Return nil if no change in files.</span>
<span class="linenr"> 42: </span>  (<span style="color: #ff4040;">let</span> ((handler (find-file-name-handler file 'dired-compress-file))
<span class="linenr"> 43: </span>        suffix newname
<span class="linenr"> 44: </span>        (suffixes yc/dired-compress-file-suffixes))
<span class="linenr"> 45: </span>
<span class="linenr"> 46: </span>    <span style="color: #fa8072;">;; </span><span style="color: #cd5c5c; font-style: italic;">See if any suffix rule matches this file name.</span>
<span class="linenr"> 47: </span>    (<span style="color: #ff4040;">while</span> suffixes
<span class="linenr"> 48: </span>      (<span style="color: #ff4040;">let</span> (case-fold-search)
<span class="linenr"> 49: </span>        (<span style="color: #ff4040;">if</span> (string-match (car (car suffixes)) file)
<span class="linenr"> 50: </span>            (setq suffix (car suffixes) suffixes nil))
<span class="linenr"> 51: </span>        (setq suffixes (cdr suffixes))))
<span class="linenr"> 52: </span>    <span style="color: #fa8072;">;; </span><span style="color: #cd5c5c; font-style: italic;">If so, compute desired new name.</span>
<span class="linenr"> 53: </span>    (<span style="color: #ff4040;">if</span> suffix
<span class="linenr"> 54: </span>        (setq newname (substring file 0 (match-beginning 0))))
<span class="linenr"> 55: </span>    (<span style="color: #ff4040;">cond</span> (handler
<span class="linenr"> 56: </span>           (funcall handler 'dired-compress-file file))
<span class="linenr"> 57: </span>          ((file-symlink-p file)
<span class="linenr"> 58: </span>           nil)
<span class="linenr"> 59: </span>          ((and suffix (nth 1 suffix))
<span class="linenr"> 60: </span>           <span style="color: #fa8072;">;; </span><span style="color: #cd5c5c; font-style: italic;">We found an uncompression rule.</span>
<span class="linenr"> 61: </span>           (<span style="color: #ff4040;">if</span>
<span class="linenr"> 62: </span>               (and (or (not (file-exists-p newname))
<span class="linenr"> 63: </span>                        (y-or-n-p
<span class="linenr"> 64: </span>                         (format <span style="color: #d78700;">"File %s already exists.  Replace it? "</span>
<span class="linenr"> 65: </span>                                 newname)))
<span class="linenr"> 66: </span>                    (not (yc/dired-check-process (concat <span style="color: #d78700;">"Uncompressing "</span> file)
<span class="linenr"> 67: </span>                                                 (nth 1 suffix) (nth 2 suffix) file)))
<span class="linenr"> 68: </span>               newname))
<span class="linenr"> 69: </span>          (t
<span class="linenr"> 70: </span>           <span style="color: #fa8072;">;;; </span><span style="color: #cd5c5c; font-style: italic;">We don't recognize the file as compressed, so compress it.</span>
<span class="linenr"> 71: </span>           <span style="color: #fa8072;">;;; </span><span style="color: #cd5c5c; font-style: italic;">Try gzip; if we don't have that, use compress.</span>
<span class="linenr"> 72: </span>           (<span style="color: #ff4040;">condition-case</span> nil
<span class="linenr"> 73: </span>               (<span style="color: #ff4040;">let</span> ((out-name (concat file <span style="color: #d78700;">".7z"</span>)))
<span class="linenr"> 74: </span>                 (and (or (not (file-exists-p out-name))
<span class="linenr"> 75: </span>                          (y-or-n-p
<span class="linenr"> 76: </span>                           (format <span style="color: #d78700;">"File %s already exists.  Really compress? "</span>
<span class="linenr"> 77: </span>                                   out-name)))
<span class="linenr"> 78: </span>                      (not (yc/dired-check-process (concat <span style="color: #d78700;">"Compressing "</span> file)
<span class="linenr"> 79: </span>                                                   <span style="color: #d78700;">"7z"</span> <span style="color: #d78700;">"a"</span> out-name file))
<span class="linenr"> 80: </span>                      <span style="color: #fa8072;">;; </span><span style="color: #cd5c5c; font-style: italic;">Rename the compressed file to </span><span style="color: #32cd32;">NEW</span><span style="color: #cd5c5c; font-style: italic;">NAME</span>
<span class="linenr"> 81: </span>                      <span style="color: #fa8072;">;; </span><span style="color: #cd5c5c; font-style: italic;">if it hasn't got that name already.</span>
<span class="linenr"> 82: </span>                      (<span style="color: #ff4040;">if</span> (and newname (not (equal newname out-name)))
<span class="linenr"> 83: </span>                          (<span style="color: #ff4040;">progn</span>
<span class="linenr"> 84: </span>                            (rename-file out-name newname t)
<span class="linenr"> 85: </span>                            newname)
<span class="linenr"> 86: </span>                        out-name))))))))
<span class="linenr"> 87: </span>
<span class="linenr"> 88: </span>(<span style="color: #ff4040;">defadvice</span> <span style="color: #1e90ff; font-weight: bold;">dired-compress</span> (around yc/dired-compress )
<span class="linenr"> 89: </span>  <span style="color: #87ceeb;">"If last action was not a yank, run `</span><span style="color: #87ceeb; font-weight: bold;">browse-kill-ring</span><span style="color: #87ceeb;">' instead."</span>
<span class="linenr"> 90: </span>  (<span style="color: #ff4040;">let*</span> (buffer-read-only
<span class="linenr"> 91: </span>         (from-file (dired-get-filename))
<span class="linenr"> 92: </span>         (new-file (yc/dired-compress-file from-file)))
<span class="linenr"> 93: </span>    (<span style="color: #ff4040;">if</span> new-file
<span class="linenr"> 94: </span>        (<span style="color: #ff4040;">let</span> ((start (point)))
<span class="linenr"> 95: </span>          <span style="color: #fa8072;">;; </span><span style="color: #cd5c5c; font-style: italic;">Remove any preexisting entry for the name </span><span style="color: #32cd32;">NEW</span><span style="color: #cd5c5c; font-style: italic;">-FILE.</span>
<span class="linenr"> 96: </span>          (<span style="color: #ff4040;">ignore-errors</span> (dired-remove-entry new-file))
<span class="linenr"> 97: </span>          (goto-char start)
<span class="linenr"> 98: </span>          <span style="color: #fa8072;">;; </span><span style="color: #cd5c5c; font-style: italic;">Now replace the current line with an entry for </span><span style="color: #32cd32;">NEW</span><span style="color: #cd5c5c; font-style: italic;">-FILE.</span>
<span class="linenr"> 99: </span>          (dired-update-file-line new-file) nil)
<span class="linenr">100: </span>      (dired-log (concat <span style="color: #d78700;">"Failed to compress"</span> from-file))
<span class="linenr">101: </span>      from-file))
<span class="linenr">102: </span>  )
<span class="linenr">103: </span>(ad-activate 'dired-compress)
</pre>
</div>

<p>
You can find it at
<a href="https://github.com/yangyingchao/tubo-env/blob/master/.emacs.d/rc/05-rc-misc.el">https://github.com/yangyingchao/tubo-env/blob/master/.emacs.d/rc/05-rc-misc.el</a> line:129.</p>
